[
  {
    "id": "12332296856",
    "userName": "App Store War",
    "userUrl": "https://itunes.apple.com/us/reviews/id1171838562",
    "version": "2.0.15",
    "score": 5,
    "title": "Best finance app period",
    "text": "I was looking for a replacement for Nerdwallet as it couldn’t connect Fidelity to itself for whatever reason. I asked a finance subreddit about alternative recommendations. Monarch caught my eye out of the recommendations and I tried it with an open mind. The very first day I tried it I was 100% sold. How this is not the top finance app ratings and popularity wise is a miss to me. It genuinely has everything. I was pleasantly surprised that it not only connected my Fidelity account but it also showed all of my investments separately from my cash which I thought was so convenient. It also had a “reoccurring” tab where I can put and see all of my incoming expenses and income on whatever frequency basis it comes in. The “rules” literally allows me to distinguish any type of transaction I want with a simple if, then function. When I saw this I was more then sold alone. I can go on and on about all the different things encompassing this app but the bottom line is it will change your life. It’s THEE 21st century finance app. Buy it annually because you’ll save more and enjoy having all your finances everywhere all in one place. Use the refer a friend come as well to give your friends a 30 day trial instead of s typical 7 so they can try as well. They might be a harder sell but 30 days is more than enough time to realize this is the best finance app period",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2025-02-19T21:57:55-07:00"
  },
  {
    "id": "10942477118",
    "userName": "Karen in Monterey",
    "userUrl": "https://itunes.apple.com/us/reviews/id39247756",
    "version": "1.0.185",
    "score": 5,
    "title": "This one is a winner!!",
    "text": "As a die-hard Mint user, I was horrified when I heard they were shutting it down. And after doing a lot of research, I was convinced no one else could replace it. But boy, was I wrong!! Monarch Money is SO much better than Mint was and it is worth every penny! As with any new app—especially a powerful financial one—there is a bit of a learning curve, however so much can be automated that it soon nearly takes care of itself. And in the few months that I have been using it, the Monarch team has been cranking out the improvements faster than any other app I have ever used. Truly impressive! \n\nThere are sometimes glitches with the data aggregators that automatically gather the transactions and data from your financial institutions, but Monarch is constantly and actively working to improve that aspect, so I am willing to put up with a bit of inconvenience as they work it out with the thousands of institutions they connect to. (By “inconvenience” I mean I sometimes have to re-login to an institution to re-connect it….not a big deal.)\n\nMonarch has knocked it out of the park with this “Mint on steroids” solution that they have developed. I can’t wait to see what other fabulous features they implement that I never even knew I needed. Keep it up, Monarch!! You make me glad that Mint shut down and motivated me to find something exponentially better!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-02-15T11:44:10-07:00"
  },
  {
    "id": "11029569436",
    "userName": "heyitscaylie",
    "userUrl": "https://itunes.apple.com/us/reviews/id587190081",
    "version": "1.0.190",
    "score": 5,
    "title": "OBSESSED!!! Two suggestions…",
    "text": "This is extremely close to mint. Its very simple, very clean, and I like that you can add your partner if you want. No syncing issues either. Just a week of using and it’s already helping me me more mindful of what I’m spending with daily check ins. Since a lot of competitors are cheaper or even have a one time buy it feature, I would really really like to request the one time buy. Make it expensive enough for others who don’t want to commit to a budget app to stay on a month by month subscription, but just the right price for someone like me who knows what they like in a budgeting app and are willing to pay. I love Monarch. I don’t like subscriptions. Another thing that isn’t super necessary but that I would enjoy are little challenges, or rewards for in the app when I am continuing good money habits/saving. There’s a few other apps out there that do this, including Mint (RIP), and I really had fun with it. \n\nAgain, these are just suggestions. I love your app and the effort that has been put into it. It shows. Congratulations on gaining a lot of customers! I know the whole team for Monarch must be thrilled. Sometimes it just takes one app disappearing for others to take the risk on you, download your app, and absolutely love it!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-03-10T08:07:19-07:00"
  },
  {
    "id": "11097521050",
    "userName": "Ericpsu",
    "userUrl": "https://itunes.apple.com/us/reviews/id220882460",
    "version": "1.0.192",
    "score": 4,
    "title": "Mint features for infinitely more money",
    "text": "This has potential to be better than Mint, but there are definitely some hurdles. I’ll focus on the constructive criticism. I’ve been using this for a couple weeks and there was a decent amount of work involved in transferring Mint data and setting everything up. But I’m glad it was possible. What’s unacceptable is that every morning at about 4am I get a 2 factor auth text message for one of my accounts. I’m not sure why that happens since it seems to update just fine. Maybe I should try linking the account a different way but I’m worried it will erase the history imported from Mint. The goals feature is interesting. I don’t necessarily have a goal in mind but I added a savings goal to test the feature and it added a savings line in my budget. What’s weird is regardless of how much I save each month that budget item stays at zero unless I designate a transaction towards that goal. But if I designate a transaction as being a part of that savings goal it’s completely detached from what I actually saved that month (I.e. selecting a paycheck for a savings goal implies I saved the entire paycheck). So in short I like this app, and it has potential to maybe even be better than Mint, but I don’t like it a $100/year subscription worth. I would consider a lifetime subscription and would recommend that to developers as an option.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-03-28T23:38:56-07:00"
  },
  {
    "id": "12555865788",
    "userName": "Lelouch1",
    "userUrl": "https://itunes.apple.com/us/reviews/id86536409",
    "version": "2.0.23",
    "score": 3,
    "title": "It’s fine but the goal tracking is…",
    "text": "I’m in my fourth month of Monarch. I sorely missed Mint Money after it disappeared and was reluctant to use Monarch, which was cost prohibitive, for many years. It is a good alternative and I get the same user experience as Mint. Month-to-month tracking and budget managing is simple and quick. I open the app a couple I’d times a week to do some relabeling. I feel less intimidated by my monthly expenses and can easily visualize my spending. HOWEVER, I’m really disappointed in the goal tracker. For example, I’ve saved for a vacation and I’m ready to spend what I have saved. I can’t “add” the savings to my monthly budget to cover expenses for travel plans (there is a travel label but not goal specific), such as plane tickets. I can’t earmark an expense in my transaction fees as coming out of a goal; it can ONLY come out of the monthly budget. I tried paying the expense by transferring the funds from the dedicated savings account, but that didn’t work either. That being said, looking at that spending on a month-by-month basis doesn’t work as you’re planning for a single event across several months or longer. I wish I could create a separate budget in the app and track my expenses under that one goal. But I can’t! So I’ll be using Excel and hiding each transaction from my feed. This tells me that Monarch is only really good for SIMPLE budgeting/savings.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2025-04-17T18:12:44-07:00"
  },
  {
    "id": "11093094646",
    "userName": "TakticalTekniq",
    "userUrl": "https://itunes.apple.com/us/reviews/id212318871",
    "version": "1.0.192",
    "score": 5,
    "title": "Mint on Steroids is 100% Accurate",
    "text": "“Karen in Monterey” hit it out of the park with her review. I too came over from Mint and was worried that I wouldn’t find another app that could be as simple to use on a day to day basis while also allowing me to dig deep into my finances when I do my occasional financial realignment. BOY WAS I WRONG. \n\nI’m now one of those folks that are GLAD that Mint shut down so that I could find this app. “Mint on Steroids” is exactly right! You can do as much or as little as you want in the app and unlike Mint, it will learn all of your finances over time if you let it. This includes automatically recording your recurring bills (which you had to manually input in Mint). In addition to that, the UI is beautiful both online and in the apps and the bank connections are pretty solid. I’ve received two or three emails about my retirement accounts disconnecting but they always reconnect themselves without me doing anything. In addition, they just added support for the Apple Card which most financial apps that I’ve seen don’t have. \n\nI went from reluctantly switching to a paid app to now knowing that as long as they keep up this fantastic service, I’ll be a lifetime customer. I HIGHLY recommend you try it out if you’re looking for a Mint replacement.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-03-27T18:06:45-07:00"
  },
  {
    "id": "8097034262",
    "userName": "bsilva09",
    "userUrl": "https://itunes.apple.com/us/reviews/id206311842",
    "version": "1.0.53",
    "score": 5,
    "title": "Best budget app, only need to change goals feature",
    "text": "Overall, I really like simplicity yet robust feature set of the app. I use this instead of mint now because mint is very clunky and has lots going on. This app works quicker, easier to navigate, and the best feature (monthly budgets) is structured in my opinion the right way. You can see how much left to spend and it works. Also, I can finally use a budgeting app with my spouse that she isn’t confused by! \n\nThe best feature for couples is that we both can use the app! \n\nOnly feature I think doesn’t work well and if changed would truly set this app apart from everything is the Goals feature. It’s not feasible because if you contribute money to your “car savings” account, that transaction cannot be tracked in your goal category. So every time you put money in particular savings account, the goals category on your budget doesn’t track that expense in the category at all. So, you have to go into goals and manually allocate money there. Goals need to be linked to specific bank accounts so that there’s someway to track when a goal is being fulfilled monthly. Mint does this well and I think you guys should adopt this feature and everyone will use the feature more.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2021-12-05T00:49:55-07:00"
  },
  {
    "id": "10761934254",
    "userName": "NMKokopelli",
    "userUrl": "https://itunes.apple.com/us/reviews/id328206476",
    "version": "1.0.174",
    "score": 5,
    "title": "A good alternative to Mint.",
    "text": "Used mint for a number of years and loved it. Because the Credit Karma replacement lacks budgeting I looked for an alternative. I tested Rocket Money, Simplifi and Quicken classic. I chose Monarch because the interface was easy to adapt to. The conversion was fairly easy but it was a bit of a chore getting everything categorized properly. One thing I do miss is the calendar that let me know when credit card payments were due. I love that the reconciled tag is permanent, mint only kept the tag for the current session. It would be nice to have a hot key to tag a transaction as reconciled rather than having to go through the transaction detail then the tags selection. Overall I am very pleased. I don’t really use any information on the start up page. Would prefer to go directly to the accounts page. I like the way they are showing budget vs spending. Yes, it’s not free, but neither are programmers. And the lack of ads is refreshing. A very good value for the money. I read one review that said the wished it would update accounts faster. I am sure this is more a function of the bank and credit card company’s policies but it did seem that mint was a little faster, perhaps.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-12-30T00:36:17-07:00"
  },
  {
    "id": "10582387239",
    "userName": "NotKewl",
    "userUrl": "https://itunes.apple.com/us/reviews/id213389404",
    "version": "1.0.162",
    "score": 4,
    "title": "What we should expect",
    "text": "If you are a former mint user, this should feel right at home. Don’t be surprised if most of it seems borrowed, as that former product ownership is leading the charge. That isn’t a bad thing. I think Monarch closes some gaps too with a better full picture perspective of your cash flow and complete money breakdown. It is much more expensive than free, so don’t even compare that perspective. I do think the platform is more robust and reliable with its connections and multi-device usability. If you compare to Quicken Simplifi, connection compatibility is far better. If you compare to co-pilot, they may seem similar, but Monarch does let you do household management. UI is subjective, so you should compare different products if you find anything an absolute deal breaker. Overall, Monarch is easy to navigate and feels intuitive. Goals still feel a bit awkward if you are familiar with Mint, but you can now attribute transactions to goals, which makes them a bit more intuitive. The fact you need to attribute accounts to drive the behavior seems limiting at times, and forces an “envelop budgeting” feel. At this point, it seems like the best available option, if your budget allows for it. If you are hands on with your money management, this shouldn’t disappoint.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-11-13T11:52:34-07:00"
  },
  {
    "id": "7509016853",
    "userName": "Wplay",
    "userUrl": "https://itunes.apple.com/us/reviews/id43524420",
    "version": "1.0.24",
    "score": 5,
    "title": "The perfect way to manage my financials and I can tell they’re actively working to make it better!",
    "text": "I’ve tried several financial apps and this is by far the best and most integrated one. All of my accounts seamlessly connect (although I wish they would update faster). I use the iOS app and the browser version on my iPad. I hope they release an iPad version soon. The UI and product experience is great, although I do wish that they made the “planning” experience feel a bit more intuitive and structured. I found it difficult to understand how to set my budgets and where to compare what my typical spending for each expense type was. Even though that was part of the process it wasn’t immediately apparent how to set things and what they meant. It’s still a better experience than any of the other apps I’ve tried. I really like that I can add my fiancé and that we can both begin to see how our combined financials look like. I like that they show what features they are currently working on and allow users to provide input directly. I look forward to using Monarch and to see them improve on an already great experience.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2021-06-26T11:25:58-07:00"
  },
  {
    "id": "11331268101",
    "userName": "Mark3685",
    "userUrl": "https://itunes.apple.com/us/reviews/id28700555",
    "version": "1.0.202",
    "score": 5,
    "title": "Better than Mint",
    "text": "I was a hardcore Mint user with data going back nearly a decade - when they shut the app down I felt like I was financially flying blind until I found Monarch.  Monarch syncs well with all my accounts and well as tracks my primary home and vehicles to give the same rolling net worth calculation Mint did.  The budgeting section functions in a similar way but categorizes and renames transactions more accurately and consistently than Mint did.  It is very intuitive to how I budget and think about my finances.  I LOVE that Monarch makes a point of showing you your personal SAVINGS RATE per month/quarter/year (something I followed in Mint but had to calculate myself).  I also like that there’s no data sharing or advertising as it’s a paid product.  I would highly recommend to anyone looking to bring order to their financial life, set goals and accurately track progress toward those goals.  IMHO, you really need an app/program like Monarch to understand and follow your personal financial situation.  After Mint, I tried Quicken Simplifi and then YNAB - Monarch is hands down the best.  I hope this app stays around for a long time.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-06-01T06:54:00-07:00"
  },
  {
    "id": "10868771992",
    "userName": "ehall3",
    "userUrl": "https://itunes.apple.com/us/reviews/id170784650",
    "version": "1.0.180",
    "score": 5,
    "title": "Feature Rich Budgeting tool, puts Mint in the dust!",
    "text": "This is a great budgeting tool with excellent features.  Previously a longtime Mint user and I was frustrated by the impending switch with Mint being scrapped.  When it became clear that CreditKarma wasn’t even going to come close to meeting my budgeting needs I searched elsewhere.  Quicken simplify was a bust with no rollover budget options and I was not a fan of its more rigid approach.  \nMonarch Money may cost a $99 a year, but it is feature rich and well worth the price.  It has far better connectivity, and in the few cases where they cannot connect (Apple Card) they have an extremely user friendly statement import feature solving the gap.  Their flexibility with budgeting by category or Group is amazing.  The rules feature is more robust and far more functional than Mint ever was. Finally the concept of a “family” or “household” allowing for flagging transactions as “Needs Review” and assigning to a family member is the cherry on top. \n\n Truly I am glad Mint is now defunct, I only wish they had done it sooner so I would have found Monarch Money before now. 100% recommend!!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-01-26T22:44:17-07:00"
  },
  {
    "id": "12389137399",
    "userName": "Wanderingthru",
    "userUrl": "https://itunes.apple.com/us/reviews/id33035516",
    "version": "2.0.17",
    "score": 5,
    "title": "extremely customizable!",
    "text": "The folks behind Monarch Money clearly thought through all the potential needs of their customer to create a product that can work for a whole range of budget types and needs. It has functions I have not found elsewhere, such as switching between traditional budgeting and zero-based budgeting, clearing all transactions before a particular start date, allowing spouses to have two different logins so they can tag purchases for the other to review, rolling over both positive and negative balances in budget categories, a tab to view cash flow separately from net worth and another for  the budget, ability to insert notes about a purchase, ability to change dates on purchases (so that, for instance, you can put a return on the same month as a purchase even if it was a day into the next month), a category that is not included in your budget for “transactions” which keeps things like credit card payments from throwing things off…I could go on!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2025-03-06T08:48:56-07:00"
  },
  {
    "id": "10818597652",
    "userName": "Pgp10",
    "userUrl": "https://itunes.apple.com/us/reviews/id138001259",
    "version": "1.0.177",
    "score": 3,
    "title": "Frustrating - Pluses and minuses",
    "text": "Migrated from Mint. 3.5 stars. I see the potential, but worry if they’ll have the resources or motivation to get it there. It’s not a totally functional system. Most importantly, your balances can’t be trusted - many say they were updated minutes ago but can be thousands of dollars off of accurate. This is a pretty key issue - if I can’t trust the app or the data, then why use it? I find myself logging in so much less than I did to mint, just because it doesn’t give me an accurate picture, frustrates me, and leads me to need to go into each individual account’s app to get a sense of where they actually stand. Use interface is good, but of course support is completely under water due to the change, and thus non-responsive and unhelpful. There doesn’t seem to be an integration with my Empower 401k, which is also a problem. Hoping they’ll iron these basic things out, or I’m going elsewhere at the end of my trial.\nNo support for investment transactions (?????). They suggest I pay $100/year to lose the main features I used and had for free with mint. I’m sure their development team is aware of this, but yikes.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-01-13T13:13:16-07:00"
  },
  {
    "id": "12719641122",
    "userName": "spalmo",
    "userUrl": "https://itunes.apple.com/us/reviews/id132716555",
    "version": "2.0.30",
    "score": 5,
    "title": "Mint best replacement gets better every month",
    "text": "So glad monarch was available when mint shutdown and connects to all my accounts and great features. Love the rules feature to greatly assist with future transactions. The reporting aspect online real nice. Realistically people who complain about minor stuff is surprising as the usefulness of having ALL of my financial info in single app is massively needed for all families as they can always go into individual accounts but it takes too much time to consolidate manually. I look forward to additional upcoming features as the reports became available on web and goals feature is also being worked on, but quicken simplifi and the YNAB apps are also great but have issues connecting to my accounts and YNAB too much time whereas the monarch web app is so easy and provides all insight needed where I just need to insure categories correct which takes seconds to adjust and rules to enhance. Definitely worth $8 month to track my entire budget",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2025-05-31T07:23:01-07:00"
  },
  {
    "id": "11471207985",
    "userName": "Seattle Jay",
    "userUrl": "https://itunes.apple.com/us/reviews/id3145885",
    "version": "1.0.208",
    "score": 5,
    "title": "In an hour, I had it working better than a quick file I had been using for 20 years.",
    "text": "That’s no joke. I was really getting frustrated with my quicken file which had 20 years of data in it. I purged off some of the older stuff, but it was just behaving so erratically because there were just so many cobwebs in it. I was getting increasingly frustrated with syncing errors and connections that just wouldn’t work at all.\n\nDecided to give monarch money a try after stacking Benjamin‘s had recommended it’s so highly. Literally, in about an hour i had almost all my accounts set up and working budget that needs some tweaks but was a really great starting point. Invited my wife to it. she’s already signed up and, we’ve converted.\n\nI was a little disappointed in the goals section. It’s very very basic. Hopefully that’s where they will do their next development, but it is nice to have it in there. Other than That the functionality is fantastic. Only way to go at this point.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-07-08T16:32:04-07:00"
  },
  {
    "id": "10704016864",
    "userName": "Lord_VT",
    "userUrl": "https://itunes.apple.com/us/reviews/id906562683",
    "version": "1.0.172",
    "score": 5,
    "title": "Refund request still ongoing [SOLVED]",
    "text": "UPDATE: I actually got in touch with them through Reddit and the matter was taken care of in less than five minutes on the same day of the review. I assume they are overwhelmed with Mint migration. They were transparent and trustworthy. Glad we worked it through. \n\n ORIGINAL REVIEW: I tried both Monarch and Copilot. Neither of those actually worked for me so I cancelled both before trail ended from the Apple subscription tab. Long story short, Copilot no issues. Monarch charged me the full year ($100) and the second the charge hit my account I emailed them explaining the situation and asking for refund since I have not been using the app for the whole trial. Still waiting to hear back, it’s been days and it’s really frustrating. I will keep this review updated. Either way, DO NOT CANCEL TRIAL on Apple Settings and the fact that they do not email you of the upcoming charge and the fact that they set it annual billing instead of monthly billing is extremely upsetting.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-12-16T10:56:29-07:00"
  },
  {
    "id": "12374794658",
    "userName": "TrussFrame",
    "userUrl": "https://itunes.apple.com/us/reviews/id46219389",
    "version": "2.0.17",
    "score": 5,
    "title": "Fantastic Budgeting App",
    "text": "This app has helped me so much! I have never felt more confident about my finances and am happy to pay the annual subscription. I am able to save more, invest more, and keep track of my guilt-free spending (and more importantly not feel guilty about spending for the sake of frugality). The ability to rollover categories/groups; move money from one category/group to another; have rules that automatically categorize transactions; and split transactions are all fantastic features. \n\nI’ve previously kept track of my finances on a spreadsheet, and have used Mint previously. Going to Monarch, however, is next-level for sure.\n\nI recommend this app to everyone, and those that have started using it all love it. It took some time to get everything set up to my liking, but after using this for over a year, that time was well worth it. I have no desire to go to another budgeting app as this checks all the boxes. Thank you, Monarch!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2025-03-02T13:15:25-07:00"
  },
  {
    "id": "11059588680",
    "userName": "DaveB1977",
    "userUrl": "https://itunes.apple.com/us/reviews/id296547368",
    "version": "1.0.191",
    "score": 5,
    "title": "Great budgeting and net worth tracking",
    "text": "I used to track net worth and account balances in mint. I’d budget with a separate app. With mint’s sunset, I was drawn to monarch’s features which allow me to do both on one app and so glad I tried it. My old budget software had become a drag - I’d categorize in large batches and get frustrated with the experience. Monarch’s rules and automation are so easy to establish and configure - I find myself categorizing less and less. I also categorize more frequently as I’m often already in the app checking investment balances, thus when I do categorize it seems much less tedious. The UX makes it engaging to perform mundane tasks like that.  I’m looking forward to reports and toying with the ai. The month in review has already seen benefitial. Sure I’ll find negatives over time, but so far incredibly happy I made the switch!! PS - huge shoutout to support who gave me an extra month free to flush out some bugs syncing my accounts.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-03-18T14:42:20-07:00"
  },
  {
    "id": "11081851626",
    "userName": "tacofanatic33",
    "userUrl": "https://itunes.apple.com/us/reviews/id182111065",
    "version": "1.0.192",
    "score": 5,
    "title": "Came here from Mint - VERY Pleased!",
    "text": "Like a lot of longtime Mint users, I was not a fan of Mint closing down, and “forcing” its users to move to Credit Karma. Credit Karma is a disaster and nothing more than a data harvester/ad farm for credit cards/loans. Not to mention, doesn’t provide ANY of the same features I used and trusted Mint for years to do. I did not want to go this route. Enter Monarch. Very pleased with the interface, budget tracking tools, dashboard features, and ability to create rules and set budgets. Monarch is Mint on steroids. So far, I have not run into any issues with account syncs (like some have mentioned). It provides a clean, holistic look at everything going on. For any Mint users who were abandoned by Intuit’s greediness, Monarch is a great alternative! While Monarch is a “newer” platform, they have gained my trust, and I have no doubt this app will only get better as time goes by. Thank you, Monarch team for rescuing me from the Mint shutdown fiasco!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-03-24T15:10:47-07:00"
  },
  {
    "id": "11952465427",
    "userName": "RghSFL",
    "userUrl": "https://itunes.apple.com/us/reviews/id128024608",
    "version": "1.0.232",
    "score": 3,
    "title": "Great app if accounts would stay connected",
    "text": "This is easily a five star app, except for one thing. Accounts are constantly loosing their connection. Sometimes they will reconnect using the email link, but many times in the 1 year I have been using the app, they don’t. Customer support is usually quick to attempt to help, but the help is usually the same - force a full refresh and if that doesn’t work setup a new connection which involves what they call merging the old account with the new. In reality, it is exporting the accounts from the old now disconnected account to a CVS file and then importing them into the new account which resets the Reviewed status meaning hundreds of transactions have to be reviewed again.  This is extremely time consuming and has to be done on a computer browser. It cannot be done in the app. The annual fee for Monarch is not cheap and for a paid subscription, it should not have these issues. It’s too bad, because otherwise it is a great money management app full of features and a great interface.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-11-15T04:46:11-07:00"
  },
  {
    "id": "12223269692",
    "userName": "JoeyDSchmoey",
    "userUrl": "https://itunes.apple.com/us/reviews/id163271420",
    "version": "2.0.9",
    "score": 1,
    "title": "Mint Convert",
    "text": "*Updated Review*\nI’m now updating my review to 1 star. After about a year of use, I’ve found that accounts will disconnect without informing me and showing that it’s reporting balances and transactions when it’s really not; that’s unacceptable. This has happened and is currently happening for almost half of my connected accounts. I can no longer recommend this app as I no longer trust it with the most basic thing it’s supposed to do of reporting and recording all transactions and account balances and realizing when that’s not happening rather than happily showing it’s successfully connecting to the financial institutions when it’s really not.\n\n*Original Review* Begrudgingly downloaded Monarch when I was forced off of Mint but pleasantly surprised with just how great it is with every feature I wanted and even things that I didn’t even know I wanted. I’ve tried numerous of the other budgeting apps but settled on this one because it’s the best: most aggregators, beautiful UI, intuitive interface, rich customization, meaningful notifications, and great reporting. I’m happy to use Monarch now and it may very well be, dare I say it, better than the GOAT that was Mint.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2025-01-23T19:04:10-07:00"
  },
  {
    "id": "11102249163",
    "userName": "ncamarda",
    "userUrl": "https://itunes.apple.com/us/reviews/id399312585",
    "version": "1.0.194",
    "score": 4,
    "title": "Almost perfect",
    "text": "I recognize that this app is constantly being updated and has had a huge surge of users with the closing down of Mint. I like this app a lot, and the fact that I can co-manage my finances with my spouse. However, the 1) recurring expenses/income is buggy and doesn’t allow for a range dollar amount (Ie different credit card payment amounts show up as separate recurring events on the same day). GitHub copilot does this really well actually; 2) the tagging system is not built out quite yet, so you can’t for example associate purchases to a certain person in your household and see how much they spent as a fraction of the total spending you are tracking for the household; 3) I love the idea of the AI assistant but it’s not very intelligent / hasn’t impressed me yet with any novel use cases. \n\nFixing these three things would make me change my rating to 5 stars. Like I said, it’s a great app that runs well and looks nice, but there are some little things that make it less perfect.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-03-30T06:08:36-07:00"
  },
  {
    "id": "10705852321",
    "userName": "DJ Galda",
    "userUrl": "https://itunes.apple.com/us/reviews/id39737744",
    "version": "1.0.172",
    "score": 5,
    "title": "Complex Mint profile transferred to Monarch. New UX is very fast.",
    "text": "I imported my data from Monarch to Mint after having 14 years of data, over 18,000 transactions, a dozen accounts, and close to 50 categories. The hardest part was cleaning up bad data in Mint and matching custom categories to Monarch’s, but I learned later that’s not required because Monarch will let you keep all your custom categories. Performance-wise, this app screams compared to Mint.\n\nWhat’s most important is that I am far more productive in Monarch than I ever was in Mint. Its easy to do batch updates. The categories manager is slick and even allows you to attach emojis. The emojis seem trivial but make reading the transactions list easier. Finding everything is smoother.\n\nIt’s also possible to attach company logos to merchants the app doesn’t already know about. I added my employer’s logo to my paycheck entries, for example, and it makes it much easier to spot them amid the noise.\n\nI recommend that Mint users add all accounts before importing the CSV. Also add “manual” accounts for defunct credit cards, bank profiles, etc. When the import happens the transactions for dead accounts will have a bucket to hop into. If the four step import wizard takes longer than an hour for you to key in your preferences, take notes of what you changed cause that process might time out at the end and you’ll have to start over.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-12-16T20:01:28-07:00"
  },
  {
    "id": "12042350192",
    "userName": "Stone804",
    "userUrl": "https://itunes.apple.com/us/reviews/id28145157",
    "version": "1.0.237",
    "score": 3,
    "title": "Notifications are annoying, app doesn’t work well",
    "text": "I’ve literally looked at every page in every place and every “bell” but the notification number won’t go away! And every day it’s some new notification so it just keeps growing… I’m at 15, I hate uncleared notifications this is ridiculous.\n\nThe app itself won’t actually track my investments well. It shows the money but won’t show the changes. What’s the point in adding a connection to my investments if it won’t track my holdings and it keeps asking me to input them manually. Why would I waste time adding all my stocks when you have access to my whole portfolio? \n\nThe sanky doesn’t work on mobile which is the main reason I got the app to see my breakdown of income. Just overall disappointing. For all the breadth of this app/website, the front-facing development is cluttered and not intuitive and the back-end is broken. The app and website don’t talk to each other either so stuff shows on one but not the other. Super disappointing.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-12-08T20:23:44-07:00"
  },
  {
    "id": "10585391009",
    "userName": "Scott Pfursich",
    "userUrl": "https://itunes.apple.com/us/reviews/id7331778",
    "version": "1.0.162",
    "score": 5,
    "title": "Glad I found a Mint alternative",
    "text": "I’ve found this app to be more capable than Mint but also very familiar so it was an easy transition. I love being able to assign items for my wife to review, instead of having to remember to ask her about them, or texting her screenshots of transactions to find out what they are. \nThe app itself is very responsive and easy to use and customize. The only confusing thing I ran into was that a transaction needs to be applied to a goal, whereas in mint, it would automatically happen based on the account the goal was associated with. But I actually like this better because now a goal doesn’t need its own bank account.\nThe only improvement I would make, and maybe I just need to understand this better, for a loan such as a mortgage it would be great if the amount that applies to the Principal can go towards your net worth, but not the monthly budget.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-11-14T09:39:00-07:00"
  },
  {
    "id": "11130120918",
    "userName": "Confucius6",
    "userUrl": "https://itunes.apple.com/us/reviews/id43047853",
    "version": "1.0.195",
    "score": 5,
    "title": "Excellent Expense Tracking with Monarch",
    "text": "I've been using the Monarch app for several months now and I am thoroughly impressed with its capability to manage and track my expenses effectively. The user interface is intuitively designed, making it incredibly easy to navigate through different features without any hassle. What sets Monarch apart is its robust analytical tools that provide deep insights into where my money is going, allowing me to identify spending habits and adjust my budget accordingly.\n\nThe real-time tracking feature updates my expenses as they happen, ensuring that I always have the most current information at my fingertips. This immediate feedback helps in making informed decisions on the fly, enhancing my financial management. Additionally, Monarch offers customizable budgeting options that cater to various financial goals, whether it's saving for a big purchase, reducing debts, or managing daily expenses.\n\nAnother aspect I appreciate is Monarch’s security measures. I feel confident that my financial data is safe and protected, which is crucial for any financial application.\n\nOverall, Monarch has simplified the often daunting task of budget management, making it both manageable and effective for users at any financial literacy level. I highly recommend it to anyone looking to take control of their financial life with a powerful yet user-friendly tool.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-04-06T19:24:31-07:00"
  },
  {
    "id": "10967954284",
    "userName": "Alan Rome Michael Barcelona",
    "userUrl": "https://itunes.apple.com/us/reviews/id1627780589",
    "version": "1.0.185",
    "score": 5,
    "title": "Excellent App & Honest Company",
    "text": "I've never submitted an app review before but I just want to say that I appreciated when Monarch warned me that my free trial was about to expire before I committed to a yearly membership. In the past a lot of these apps would just charge me and yank cash from my account without me even realizing it. I'm going to tell everybody I know about this app because of the integrity this company has shown. Also, from a functionality standpoint, it has been far easier to sync and track transactions from all my accounts compared to any other financial monitoring app I've used. It has everything I want, it's simple to use, the interface is very user friendly, and it doesn't malfunction when connecting to my bank/credit card accounts. There isn't any reason this app won't be the #1 financial monitoring tool on the market in a few years. Keep up the good work.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-02-22T10:33:17-07:00"
  },
  {
    "id": "10744482715",
    "userName": "wflms20110333",
    "userUrl": "https://itunes.apple.com/us/reviews/id1130695853",
    "version": "1.0.173",
    "score": 5,
    "title": "Great app, but a lot of account connection problems",
    "text": "I’ve been overall happy with my subscription to Monarch, minus the fact that I experience a lot of account connection issues:\n- for a long time, I couldn’t connect my retirement account with Alerus. I emailed Monarch support about this, and there was some back and forth, but overall their customer support’s response time and helpfulness was pretty bad. After over a year, I was finally able to connect this account for the first time\n- the connection with my Chase accounts keep breaking — I’m not sure why, but a subset of those accounts would disconnect, then I’d have to reconnect everything. Usually this goes smoothly (and it’s just annoying I have to keep reconnecting), but sometimes all my transactions in one of the accounts gets duplicated, and I’d have to delete half of them/recategorize/re-review and it’s extremely frustrating\n- the connection with TreasuryDirects used to work (and just require reconnection once in a while), but for the last many months it straight up hasn’t worked. When I try to connect the account it just repeatedly gets me to perform 2FA without any progress\n\nIf it weren’t for these issues, Monarch would probably be my favorite app and I would recommend it to all my friends and coworkers. But I can’t do that knowing that the ux is buggy",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-12-25T13:33:35-07:00"
  },
  {
    "id": "11036708808",
    "userName": "J610",
    "userUrl": "https://itunes.apple.com/us/reviews/id72015771",
    "version": "1.0.190",
    "score": 3,
    "title": "Needs credit score info",
    "text": "I was forced to leave Mint like many others (the way it was handled was so careless), and I found Monarch. I like it for many things. It’s very functional for the overall purpose. But it doesn’t have an essential feature Mint did really well: credit score monitoring. Mint’s UI was perfection for credit scores. It told you your score, if it had gone up or down, and broke down the different components and how important it was, like “here’s your % credit utilization. It has a high impact. This is the chart showing what % will get you into the “excellent” rating. I can’t find a replacement anywhere. Clearly CreditKarma with all their ads and general lack is not the place to go. I feel like if Monarch would add that, I would be very satisfied. Mint was so amazing. If Monarch were smart, they’d look at Mint and ad some of their fun and useful features to Monarch. I’d like to be able to see APR and credit limit on each card. Add that and the credit score, and I’d never be able to unsubscribe.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-03-12T08:00:18-07:00"
  },
  {
    "id": "11044037105",
    "userName": "AmazinglyAwesomePleasedPerson",
    "userUrl": "https://itunes.apple.com/us/reviews/id267414864",
    "version": "1.0.191",
    "score": 5,
    "title": "Life-Changing, well worth it.",
    "text": "I honestly can’t express how much this app has helped me grasp how to handle finances. I grew up with zero financial literacy and made poor financial decisions for years. After using this app for just a few months, I’ve been able to actually understand where my money goes, how my spending impacts my long-term financial goals, and allows me to visualize and plan in a way I never could’ve been able to without this app and the tools it provides.\n\nNo resource has helped me better understand how to handle money, honestly. There was a learning curve in the beginning, but once you get into the swing of tracking and categorizing your purchases, it all comes together. Humongous thanks to the developers and the entire team — you all have made a fantastic product that is well-worth the price. Thank you, thank you, thank you!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-03-14T10:04:06-07:00"
  },
  {
    "id": "11195785292",
    "userName": "Baby agent",
    "userUrl": "https://itunes.apple.com/us/reviews/id143523299",
    "version": "1.0.197",
    "score": 3,
    "title": "Love everything other than that it doesn’t work ☹️",
    "text": "I really enjoyed this app initially- the interface, the fact that my husband and I both had access, the details about each account, etc. But after a few months, we realized there are significant glitches with syncing accounts. At first I didn’t think much of it, but then it was happening so frequently and over time, one of our accounts (a local credit union AND all Chase accounts) completely stopped syncing. Customer service was helpful in investigating and said it was an issue with the PFA for that bank. I decided to try out a different finance mgmt app and found that there were no issues with syncing in that account. Due to the frequency of the errors and the fact that our checking account shows absolutely no transactions anymore, we’re going to have to leave. I would come back if and when this gets fixed, but for now I cannot recommend it unfortunately.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-04-24T08:15:02-07:00"
  },
  {
    "id": "11255988634",
    "userName": "angelstarninja",
    "userUrl": "https://itunes.apple.com/us/reviews/id563880082",
    "version": "1.0.200",
    "score": 5,
    "title": "Financial Powerhouse!",
    "text": "Our finances are super complicated and we were just audited by the IRS. Needless to say it was time to make a change. I’ve tried several budgeting and financial apps including Dave Ramsey EveryDollar, Mint, managing by Excel, etc. I am now audit ready all the time. I know where my budget lines are at any given step, all of our accounts are visible in one place including investment accounts and I can even track the value of our assets such as our home and cars. I will say I do still need a place to put receipts, so I use Simpliwise for that. They let you put in the receipts but not export them. I learned the hard way that the IRS doesn’t accept paper receipts, they all have to be scanned in. I can now keep up with everything so easily and I’m so thankful for monarch. They also want my feedback and are constantly improving things. LOVE IT!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-05-11T07:54:59-07:00"
  },
  {
    "id": "9741655902",
    "userName": "clopez787",
    "userUrl": "https://itunes.apple.com/us/reviews/id34045037",
    "version": "1.0.115",
    "score": 5,
    "title": "Switched from Mint and very happy so far",
    "text": "After using Mint for 12 years, I decided to look for something different. \n\nI did a lot of research on the current personal finance app landscape and opened up “trial” accounts with about 5 different apps, and Monarch was by far my favorite. \n\n1. Great UX with a clean, pretty, modern UI\n2. No ads or having my data sold\n3. An app that has tablestake features such as the ability to review transactions (how does Mint still not have this???)\n4.  Zero-sum budgeting\n5. Responsive customer support \n6. Open and public product roadmap with the ability to submit and upvote feature requests \n7. Auto-categorization that is highly accurate\n\nAdditionally, I looked up a lot of their team members on LinkedIn and was happy to see that almost all of them have been there for a long time (pretty uncommon these days in the startup world), plus the CEO is ex-Mint and led their Product team before the Intuit acquisition. \n\nThe main “con” that stands out to me is price (Monarch is on the pricey side compared to the competition), but in the grand scheme of things $90 a year is doable for me if it means I don’t have to feel the frustrations I felt with Mint (I spend more than that a night at bars). \n\nReally happy so far that I made the change and looking forward to seeing how the app evolves.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-03-22T17:58:44-07:00"
  },
  {
    "id": "11335944547",
    "userName": "brycemaccabe",
    "userUrl": "https://itunes.apple.com/us/reviews/id272667039",
    "version": "1.0.202",
    "score": 5,
    "title": "Great Replacement for Mint",
    "text": "I have a pretty complex finance setup so I need something robust to manage everything. I used Mint for over a decade and loved the tools it provided. When it shut down, I looked at every available alternative. I tried the Credit Karma features but frankly, they just didn’t cut it. Every other platform lacked key features that I needed (especially with integrations with all of my institutions not being available or not working).\n\nMonarch was the one system that did everything I needed and I’m pretty impressed with it. Obviously, I miss that Mint was free & Monarch is not but it’s still worth the expense. There are still some features I’d like to see them add (such as transactions for investment accounts) but they’re well on their way & have a good development roadmap. I now recommend Monarch to anyone as the best personal finance platform.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-06-02T11:27:55-07:00"
  },
  {
    "id": "12624168542",
    "userName": "Okie501",
    "userUrl": "https://itunes.apple.com/us/reviews/id482010752",
    "version": "2.0.25",
    "score": 3,
    "title": "Monarch shortcomings",
    "text": "I have been using Monarch for over a year now.  While it meets my basic needs for budgeting and tracking expenses, it has several shortcomings that are becoming more of a problem than annoyance.  The first shortcoming is that monarch does not include an easy to use print routine.  I find this to be a major problem!  I have addressed this with Monarch with no solution yet!  The next major issue is that Monarch continually drops connection to my external accounts which requires continual reconnect attempts!  I have not discussed this with Monarch yet.  I used Mint before I was forced to switch to a different budgeting app because Mint was dropped from support by Credit Karma after Mint acquired Mint.  I did a lot of research before finally selecting Monarch.  Monarch does not come close to providing the ease of use that Mint provided!  I am not a very happy user right now.  If you are looking for this type of app, I would be hesitant to recommend this app at this time.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2025-05-05T17:34:11-07:00"
  },
  {
    "id": "11893797934",
    "userName": "Brooklyn HR guy",
    "userUrl": "https://itunes.apple.com/us/reviews/id615427590",
    "version": "1.0.229",
    "score": 5,
    "title": "Perfect for couples",
    "text": "My partner and I combined our finances 4 years ago using this, and this made it SOOO easy! I enjoy looking at our finances now, and it helps me not get stressed about it. One thing of note: I had to think really hard at the beginning about how I wanted to DESIGN our finances. You too may need to think really hard about your values, vision, mission, and goals individually and/or as a couple. Monarch forces you to get clear minded on that, which I think is a must for any personal finance system. If you end up taking hours, days or weeks to set up your joint accounts, GOOD! Put thought into the start-up design. Four years later, I barely have to touch our accounts. I look at Monarch once a month for 5-10 minutes. Done. Everything is happening automatically like it should and I just watch the accounts grow.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-10-30T16:38:25-07:00"
  },
  {
    "id": "11724255321",
    "userName": "kkastle",
    "userUrl": "https://itunes.apple.com/us/reviews/id33575055",
    "version": "1.0.220",
    "score": 5,
    "title": "Great App. Better than Mint.",
    "text": "At the time Mint was being decommissioned I was dreading finding another app, transferring the data and having it do the basics in an easy intuitive way. Monarch does that & better, imv. Retroactively grateful I had to change. Plus, it always works. With Mint I kept having “feed issues” from financial institutions to Mint. Monarch has been virtually glitch-less. & it always feel like there are real humans behind & supporting making it better. The only thing I would want to add is an easy view of consecutive monthly $spend totals comparison tool. If it’s they’re I haven’t found it. In Mint you could fairly easily view a monthly bar graph for multiple months by name. You can find specifics for each month (only) separately under budget, but viewing it in one screen comparing multiple months would be welcome, imv.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-09-14T12:33:32-07:00"
  },
  {
    "id": "6790105926",
    "userName": "Melhoshy",
    "userUrl": "https://itunes.apple.com/us/reviews/id243141429",
    "version": "1.0.6",
    "score": 5,
    "title": "Taking personal finance to the next level :)",
    "text": "I’ve been using this for a few days now and would say it’s a nice alternative to Mint that has more focus on cash flows and categorizing transaction to better understand your monthly income vs expenses, and helps you budget against them.  I really like the monthly summary page, in addition to the ability to quickly see category spend and allocate against it. \n\nI personally have a bit of an interest in the space and use Mint and Personal Capital currently, in addition to aggregating my accounts via Bank of America and Chase as well.  I am always curious to test out different features, and help me understand financial picture including investments and RSUs and such — and this app seems to “just get it”.\n\nI am quite impressed in first few days of use and will definitely be shifting more of my focus from Other apps to this.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2020-12-24T16:49:44-07:00"
  },
  {
    "id": "10575285569",
    "userName": "Dufur30",
    "userUrl": "https://itunes.apple.com/us/reviews/id100459505",
    "version": "1.0.162",
    "score": 5,
    "title": "Intuitive! Monarch is the best! Wow",
    "text": "I’ve used Mint for years. I just switched to Monarch thanks to Mint closing down.  I’ve tried almost every budgeting app, and Monarch is by far the best! It’s so intuitive and easy to use. Easy to import Mint data via CSV.  It’s really fast to update Merchants, transactions, Rules, budget and recurring subscription. I love updating logos for my merchants and consolidating duplicates. I’ve never been so aware of my complete finances!  Easy to Co-Manage with my wife who has her own account to access the budget, Mint didn’t allow this. \n\nMint was really slow, so it was unrealistic to truly update your past history.  The ONLY advantage Mint had was updating Apple Card, vs all other apps that have to import your Apple Card statements a month late.  \n\nMonarch seems to be slight cheaper if you purchase Monarch through their site, not the App Store.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-11-11T11:55:41-07:00"
  },
  {
    "id": "11621199065",
    "userName": "broevan",
    "userUrl": "https://itunes.apple.com/us/reviews/id500723002",
    "version": "1.0.215",
    "score": 5,
    "title": "Works Better for us than YNAB",
    "text": "We tried for years to make zero based budgeting work for us and always felt like failures. We are active in church, run a business, have six children whom we homeschool… like many families, we are busy. After dinner in the evening my wife and I sit down and works on our finances for 15-20 minutes before relaxing for the evening, and that was not enough to make other budgeting apps work for us. We always felt like we were behind on matching expenses and adjusting budget variables. It just wasn’t how we think. Monarch takes a more automated approach that shows our overall finance status with minimal effort. It is an interesting approach that allows us as much control as we want, and can still budget some or all categories as we see the need. It has been working very well for us.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-08-17T09:21:08-07:00"
  },
  {
    "id": "12644778852",
    "userName": "EricFreemanJr",
    "userUrl": "https://itunes.apple.com/us/reviews/id751556110",
    "version": "2.0.26",
    "score": 5,
    "title": "Best App for Finances. Period",
    "text": "Monarch Money is hands down the best personal finance app I’ve ever used. It’s not just about tracking expenses—it’s about understanding your entire financial picture. The intuitive interface makes budgeting, forecasting, and investment tracking seamless and straightforward. Unlike other apps, Monarch gives you real-time insights without the clutter, allowing you to see your net worth, spending habits, and financial goals all in one place.\n\nThe customization options are top-notch, and the integration with multiple banks and investment accounts is flawless. Whether you’re managing debt, saving for a big purchase, or optimizing your budget, Monarch Money keeps everything organized and easily accessible.\n\nIf you’re serious about mastering your finances, look no further. Monarch Money is the complete package.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2025-05-11T08:18:29-07:00"
  },
  {
    "id": "9144588582",
    "userName": "markdarkstar",
    "userUrl": "https://itunes.apple.com/us/reviews/id347182515",
    "version": "1.0.92",
    "score": 5,
    "title": "Great app; continues to improve",
    "text": "I’ve tried all of the major apps (Quicken/Simplifi/YNAB/etc.) and found that Monarch works the best for my family. It does the best job with transaction categorization and rule creation. It also syncs beautifully with accounts at my local bank that other apps couldn’t use.\n\nI’m finding the budget a bit hard to understand in month-to-month carryover, but Monarch continues to come out with new features, so I’ll just hang on. I’ve been pleased with their rollout of new functionality even in the few months I’ve been using this app.\n\nThe iPhone/iPad apps offer essentially full functionality that the web app does with only minor exceptions. This is great for someone who is on the go often and only finds time to manage money on their phone or iPad. I plan to be a Monarch customer for the long term.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2022-10-02T12:02:34-07:00"
  },
  {
    "id": "11955457838",
    "userName": "Jams30",
    "userUrl": "https://itunes.apple.com/us/reviews/id483304602",
    "version": "1.0.232",
    "score": 5,
    "title": "Golden!",
    "text": "Really love this app so far! We immediately fell in love with the platform which is extremely user friendly. After syncing your data it automatically gives you a broad view of your previous spending habits.  Nice reality check.  We also love how customizable the app is - you can get pretty detailed (which we like), or keep things simple.  The extra features outside of the budgeting like are also nice touches, but the budgeting alone is a star. There’s a widget feature you can add to your Home Screen that can display a budget item of your choosing instead of the icon. That comes in handy for any areas that you want to stay on top of.  Just after a few days of using the app we were hooked - we also tried other competing apps at the same time and none compared!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-11-15T23:09:18-07:00"
  },
  {
    "id": "10657787162",
    "userName": "18484617",
    "userUrl": "https://itunes.apple.com/us/reviews/id130088889",
    "version": "1.0.168",
    "score": 4,
    "title": "30 day review",
    "text": "I find the platform straightforward and intuitive. Rule making assignments are nice for auto categorizing. I like tying your wealth picture into your budget by linking a variety of accounts. I’d like for the platform to be able to make savings or debt payoff suggestions based on your established goals. Goal setting is nice, but lacks a greater connection in monthly budgeting. It tends to be hidden as part of the monthly budget. The platform could easily make suggestions using unspent budget funds across your goals. Email notifications are informative and straightforward. Overall I enjoy the lack of ads or pressure to buy other products like Dave Ramsey attempts to offer while inside the ecosystem. Pricing seems in line with other products that are similar. I’ve caught onto some wasteful spending that has paid for its annual service fee a month into the 12 month usage.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-12-04T13:47:26-07:00"
  },
  {
    "id": "11778886493",
    "userName": "KR16",
    "userUrl": "https://itunes.apple.com/us/reviews/id24946802",
    "version": "1.0.223",
    "score": 1,
    "title": "Sad Mint was bought out",
    "text": "I was leery of Credit Karma’s buy out of Mint and signed up for Monarch, exporting all my Mint data and deleting my account with them. I had a decade plus of financials to port over. I spent a decent amount of time setting up Monarch but was excited because former Mint team set up Monarch with all their learnings! About 9mos later, a third of my accounts won’t consistently show new data. My options are manually merging data (have yet to do this successfully), have duplicate accounts (one for historical/one for latest), or use native banking apps (which is a pain and whole reason I went with Mint, then Monarch). They were quick to advertise to ex-Minters and supply promo codes, and their teams are great at canned customer service responses, but the amount of work I’m doing I’m seriously considering re-investing into Excel / Google sheets for a custom spreadsheet. Its ridiculous to pay for a service with his level of data inaccuracy and no sense of when or when it will not stop working. I won’t be re-upping when my subscription expires.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-09-29T12:12:25-07:00"
  },
  {
    "id": "10556460186",
    "userName": "runeypants",
    "userUrl": "https://itunes.apple.com/us/reviews/id32918414",
    "version": "1.0.161",
    "score": 5,
    "title": "The iPad app isn’t optimized for iPad",
    "text": "I am loving the Monarch service, but I use the website instead of the app on my iPad. The iPad app feels like the iPhone app, but stretched across the screen. For example, the dashboard doesn’t show graphs side by side, and the transactions page just shows me the category icon, merchant short name, and amount. On the website the transactions page allows me to update categories inline and do all sorts of filtering without opening a separate filtering screen. That’s just two examples. Unfortunately, as with most websites, a lot of the “clicking” doesn’t work right (have to tap twice or accidentally “click” things while scrolling). So neither the app nor the website are great for iPad, but the website is definitely better, and that should never be true for an app.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2023-11-06T06:22:33-07:00"
  },
  {
    "id": "12059959649",
    "userName": "BrandenEarp",
    "userUrl": "https://itunes.apple.com/us/reviews/id200262672",
    "version": "2.0.1",
    "score": 5,
    "title": "Best Budgeting App / Needs More Investment Insights",
    "text": "By far the best all around money app and budgeting app I have used. Really clean interface and the AI categorization for budgets make it super easy. It is also great to saving for long term purchases. Where it is lacking, and I hope the developers consider adding, is in the “Investment” portion of the app and online. It would be great if there was a way to view performance by account, overall asset by sector allocation with all accounts, and weighting of all accounts by sector similar to what the Empower app can do. It would really help to see one’s overall financial picture and if you may be overweight in one area and underweight in another. Having some historical charting for assets would be great too. Overall an amazing app and I would recommend it over all others.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-12-13T13:54:46-07:00"
  },
  {
    "id": "11455778470",
    "userName": "Gîte 96",
    "userUrl": "https://itunes.apple.com/us/reviews/id498563799",
    "version": "1.0.208",
    "score": 5,
    "title": "Migrated from Mint What a positive difference.",
    "text": "I used to be a religious Microsoft Money user back in the day and like to track everything. Reconciling became too time-consuming. Then came along Mint and I could get good insights and transactional record. Then things went horribly wrong when they shut down and went to credit Karma which is essentially a spam engine with access to your finances. Monarch is not free but well worth it Being able to categorize and review transactions and see everything in one place has just absolutely terrific. I enjoy the iOS apps as well. Their customer service was able to implement a data connection coach change to support my two factor authentication on E*TRADE. It took a couple weeks, but they followed through. Well done, keep going Monarch money!",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-07-04T08:08:33-07:00"
  },
  {
    "id": "12075882887",
    "userName": "MBeck007",
    "userUrl": "https://itunes.apple.com/us/reviews/id123619184",
    "version": "2.0.2",
    "score": 2,
    "title": "No ability to add Property Assets",
    "text": "Monarch Money offers a sleek interface and effectively aggregates accounts, providing a clear overview of your finances. However, several issues hinder its overall utility:\n\nInability to Add Property Assets: The app lacks the functionality to include properties as assets, a significant omission for users aiming to track their complete net worth.\n\nConnectivity Issues: There are frequent disconnections with certain bank accounts, leading to duplicated transactions and inaccuracies in budgeting. ￼\n\nLimited Bill Tracking Features: The absence of a robust bill and subscription tracking system makes it challenging to manage recurring expenses effectively. ￼\n\nHowever, for $99/year, I expected more features that would help it stand out from other personal finance apps.\n\nA major drawback is the inability to add properties as assets, which makes it less useful for tracking total net worth. Additionally, the app struggles with occasional connectivity issues, leading to duplicate transactions or disconnections from bank accounts. The lack of robust bill tracking or subscription management is another limitation, especially when other apps at a similar price point offer these features.\n\nWhile Monarch has potential, it doesn’t currently justify the cost compared to other options on the market. For now, it feels like a good app that’s missing some key tools to make it exceptional.",
    "url": "https://itunes.apple.com/us/review?id=1459319842&type=Purple%20Software",
    "updated": "2024-12-17T18:36:07-07:00"
  }
]